USE [Airport]
GO



INSERT INTO [Экипаж] ([ID сотрудника], [ID вылета]) VALUES 
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Нуряев'
	AND [Имя]='Петр'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 1234'
					)
	AND [Дата вылета (по расписанию)]='12/10/2018'
	)
), 
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Апевалов'
	AND [Имя]='Лавр'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 1234'
					)
	AND [Дата вылета (по расписанию)]='12/10/2018'
	)
),
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Ромазанова'
	AND [Имя]='Ева'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 1234'
					)
	AND [Дата вылета (по расписанию)]='12/10/2018'
	)
),
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Устимовича'
	AND [Имя]='Юнона'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 1234'
					)
	AND [Дата вылета (по расписанию)]='12/10/2018'
	)
),
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Пищальников'
	AND [Имя]='Давид'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 1234'
					)
	AND [Дата вылета (по расписанию)]='12/10/2018'
	)
), 
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Весовой'
	AND [Имя]='Юрий'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 1234'
					)
	AND [Дата вылета (по расписанию)]='12/10/2018'
	)
),
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Якунова'
	AND [Имя]='Регина'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 4321'
					)
	AND [Дата вылета (по расписанию)]='14/10/2018'
	)
),
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Ухтомский'
	AND [Имя]='Адриан'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 4321'
					)
	AND [Дата вылета (по расписанию)]='14/10/2018'
	)
),
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Ожегова'
	AND [Имя]='Пелагея'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 4321'
					)
	AND [Дата вылета (по расписанию)]='14/10/2018'
	)
), 
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Любова'
	AND [Имя]='Оксана'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 4321'
					)
	AND [Дата вылета (по расписанию)]='14/10/2018'
	)
),
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Локтев'
	AND [Имя]='Терентий'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 4321'
					)
	AND [Дата вылета (по расписанию)]='14/10/2018'
	)
),
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Дюгаева'
	AND [Имя]='Агния'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 4321'
					)
	AND [Дата вылета (по расписанию)]='14/10/2018'
	)
),
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Нуряев'
	AND [Имя]='Петр'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 4321'
					)
	AND [Дата вылета (по расписанию)]='13/10/2018'
	)
), 
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Апевалов'
	AND [Имя]='Лавр'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 4321'
					)
	AND [Дата вылета (по расписанию)]='13/10/2018'
	)
),
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Ромазанова'
	AND [Имя]='Ева'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 4321'
					)
	AND [Дата вылета (по расписанию)]='13/10/2018'
	)
),
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Устимовича'
	AND [Имя]='Юнона'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 4321'
					)
	AND [Дата вылета (по расписанию)]='13/10/2018'
	)
),
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Пищальников'
	AND [Имя]='Давид'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 4321'
					)
	AND [Дата вылета (по расписанию)]='13/10/2018'
	)
), 
((
	SELECT [ID сотрудника]
	FROM [Сотрудники экипажа]
	WHERE [Фамилия]='Весовой'
	AND [Имя]='Юрий'
	), 
	(
	SELECT [ID вылета]
	FROM [Вылеты]
	WHERE [ID рейса]=
					(
					SELECT [ID рейса]
					FROM [Рейсы]
					WHERE [Номер рейса]='SU 4321'
					)
	AND [Дата вылета (по расписанию)]='13/10/2018'
	)
)
