USE [Airport]
GO

ALTER TABLE [Расписание по дням недели]  
ADD CONSTRAINT [АК_Расписание по дням недели] UNIQUE ([ID расписания], [ID дня недели])   
GO 

ALTER TABLE [Страны]  
ADD CONSTRAINT [АК_Страны] UNIQUE ([Название])   
GO 


INSERT INTO [Города] ([ID города], [Название города], [ID страны]) VALUES 
(16, 'Москва2', (SELECT [ID страны]
				FROM [Страны]
				WHERE [Название]='Россия')
)

INSERT INTO [Города] ([ID города], [Название города], [ID страны]) VALUES 
(1, 'Москва', 1),
(2,'Уфа',1),
(3,'Новосибирск',1),
(4,'Краснодар',1),
(5,'Париж',2),
(6,'Лион',2),
(7,'Рим',3),
(8,'Астана',4),
(9,'Осло',5),
(10,'Стамбул',6),
(11,'Рига',7),
(12,'Прага',8),
(13,'Берлин',9),
(14,'Цюрих',10),
(15,'Пекин',11);

INSERT INTO [Аэропорты] ([ID аэропорта], [Код аэропорта], [Название аэропорта], [Город ID]) VALUES 
(1,'','',1),
(2,'','',),
(3,'','',),
(4,'','',),
(5,'','',),
(6,'','',),
(7,'','',),
(8,'','',),
(9,'','',),
(10,'','',),
(11,'','',),
(12,'','',),
(13,'','',),
(14,'','',),
(15,'','',),
(16,'','',),
(17,'','',),
(18,'','',)

