USE [Airport]
GO

INSERT INTO [Расписание по дням недели] ([Время отправления], [Время прибытия], [ID дня недели], [ID расписания]) VALUES
('12:20', '14:40', 1, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('12:20', '14:40', 2, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('12:20', '14:40', 3, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('12:20', '14:40', 4, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('12:20', '14:40', 5, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('12:20', '14:40', 6, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('11:20', '13:40', 7, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('16:20', '18:40', 1, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),
('16:20', '18:40', 2, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),
('16:20', '18:40', 3, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),
('16:20', '18:40', 4, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),
('16:20', '18:40', 5, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),
('16:20', '18:40', 6, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),
('15:20', '17:40', 7, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),

('08:30', '11:40', 1, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1567'
							)
		AND [дата начала действия расписания]='2018/09/26'
		)
),
('08:30', '11:40', 3, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1567'
							)
		AND [дата начала действия расписания]='2018/09/26'
		)
),
('08:30', '11:40', 5, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1567'
							)
		AND [дата начала действия расписания]='2018/09/26'
		)
),
('13:30', '16:40', 2, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 7651'
							)
		AND [дата начала действия расписания]='2018/09/20'
		)
),
('13:30', '16:40', 4, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 7651'
							)
		AND [дата начала действия расписания]='2018/09/20'
		)
),
('13:30', '16:40', 6, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 7651'
							)
		AND [дата начала действия расписания]='2018/09/20'
		)
)




/*DELETE FROM [Вылеты]*/

INSERT INTO [Вылеты] ([Дата и время (фактические) вылета], [Дата и время (фактические) прибытия], 
[Кол-во проданных билетов], [Дата вылета (по расписанию)], [ID самолета], [ID рейса], [ID расписания по дням недели]) VALUES
('12/10/2018 12:20', '12/10/2018 14:30', 158, '2018/10/12', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VP-BCE (cn 7295)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 1234'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 1234'
													)
								AND ('2018/10/12' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'2018/10/12')
		)
), 
('13/10/2018 12:40', '13/10/2018 14:50', 160, '13/10/2018', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VQ-BSH (cn 6022)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 1234'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 1234'
													)
								AND ('13/10/2018' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'13/10/2018')
		)
), 
('14/10/2018 12:20', '14/10/2018 14:20', 160, '14/10/2018', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VP-BCE (cn 7295)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 1234'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 1234'
													)
								AND ('14/10/2018' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'14/10/2018')
		)
), 
('15/10/2018 12:40', '15/10/2018 14:50', 160, '15/10/2018', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VQ-BSH (cn 6022)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 1234'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 1234'
													)
								AND ('15/10/2018' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'15/10/2018')
		)
), 
/**/
(NULL, NULL, 150, '16/10/2018', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VP-BCE (cn 7295)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 1234'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 1234'
													)
								AND ('16/10/2018' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'16/10/2018')
		)
), 
(NULL, NULL, 130, '17/10/2018', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VQ-BSH (cn 6022)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 1234'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 1234'
													)
								AND ('17/10/2018' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'17/10/2018')
		)
), 
(NULL, NULL, 126, '18/10/2018', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VP-BCE (cn 7295)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 1234'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 1234'
													)
								AND ('18/10/2018' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'18/10/2018')
		)
), 
/**/
('12/10/2018 16:50', '12/10/2018 19:05', 159, '12/10/2018', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VQ-BSH (cn 6022)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 4321'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 4321'
													)
								AND ('12/10/2018' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'12/10/2018')
		)
), 
('13/10/2018 16:20', '13/10/2018 18:30', 157, '13/10/2018', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VP-BCE (cn 7295)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 4321'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 4321'
													)
								AND ('13/10/2018' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'13/10/2018')
		)
), 
('14/10/2018 16:30', '14/10/2018 18:40', 160, '14/10/2018', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VQ-BSH (cn 6022)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 4321'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 4321'
													)
								AND ('14/10/2018' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'14/10/2018')
		)
), 
('15/10/2018 17:10', '15/10/2018 19:15', 157, '15/10/2018', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VP-BCE (cn 7295)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 4321'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 4321'
													)
								AND ('15/10/2018' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'15/10/2018')
		)
), 
(NULL, NULL, 160, '16/10/2018', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VQ-BSH (cn 6022)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 4321'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 4321'
													)
								AND ('16/10/2018' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'16/10/2018')
		)
), 
(NULL, NULL, 145, '17/10/2018', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VP-BCE (cn 7295)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 4321'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 4321'
													)
								AND ('17/10/2018' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'17/10/2018')
		)
), 
(NULL, NULL, 149, '18/10/2018', 
		(
		SELECT [ID самолета]
		FROM [Самолет]
		WHERE [Регистрационный номер]='VQ-BSH (cn 6022)'
		), 
		(
		SELECT [ID рейса]
		FROM [Рейсы]
		WHERE [Номер рейса]='SU 4321'
		), 
		(
		SELECT [ID расписания по дням недели]
		FROM [Расписание по дням недели]
		WHERE [ID расписания]=( /*выбираем действующее расписание рейса*/
								SELECT [ID расписания конкретного рейса]
								FROM [Расписание рейсов]
								WHERE [ID рейса]= (
													SELECT [ID рейса]
													FROM [Рейсы]
													WHERE [Номер рейса]='SU 4321'
													)
								AND ('18/10/2018' BETWEEN [дата начала действия расписания] AND [дата окончания действия расписания])
							)
		AND [ID дня недели]= DATEPART(weekday,'18/10/2018')
		)
)
