USE [Airport]
GO

INSERT INTO [Расписание по дням недели] ([Время отправления], [Время прибытия], [ID дня недели], [ID расписания]) VALUES
('12:20', '14:40', 1, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('12:20', '14:40', 2, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('12:20', '14:40', 3, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('12:20', '14:40', 4, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('12:20', '14:40', 5, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('12:20', '14:40', 6, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('11:20', '13:40', 7, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1234'
							)
		AND [дата начала действия расписания]='2018/10/12'
		)
),
('16:20', '18:40', 1, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),
('16:20', '18:40', 2, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),
('16:20', '18:40', 3, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),
('16:20', '18:40', 4, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),
('16:20', '18:40', 5, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),
('16:20', '18:40', 6, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),
('15:20', '17:40', 7, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 4321'
							)
		AND [дата начала действия расписания]='2018/10/01'
		)
),

('08:30', '11:40', 1, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1567'
							)
		AND [дата начала действия расписания]='2018/09/26'
		)
),
('08:30', '11:40', 3, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1567'
							)
		AND [дата начала действия расписания]='2018/09/26'
		)
),
('08:30', '11:40', 5, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 1567'
							)
		AND [дата начала действия расписания]='2018/09/26'
		)
),
('13:30', '16:40', 2, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 7651'
							)
		AND [дата начала действия расписания]='2018/09/20'
		)
),
('13:30', '16:40', 4, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 7651'
							)
		AND [дата начала действия расписания]='2018/09/20'
		)
),
('13:30', '16:40', 6, 
		(
		SELECT [ID расписания конкретного рейса]
		FROM [Расписание рейсов]
		WHERE [ID рейса]=(
							SELECT [ID рейса]
							FROM [Рейсы]
							WHERE [Номер рейса]='SU 7651'
							)
		AND [дата начала действия расписания]='2018/09/20'
		)
)
