USE [Airport]
GO

ALTER TABLE [Расписание по дням недели]  
ADD CONSTRAINT [АК_Расписание по дням недели] UNIQUE ([ID расписания], [ID дня недели])   
GO 

ALTER TABLE [Страны]  
ADD CONSTRAINT [АК_Страны] UNIQUE ([Название])   
GO 

INSERT INTO [Страны] ([Название]) VALUES 
('Россия'),
('Франция'),
('Италия'),
('Казахстан'),
('Норвегия'),
('Турция'),
('Латвия'),
('Чехия'),
('Германия'),
('Швейцария')

INSERT INTO [Города] ([Название города], [ID страны]) VALUES 
('Москва', (SELECT [ID страны] FROM [Страны] WHERE [Название]='Россия')),
('Уфа', (SELECT [ID страны] FROM [Страны] WHERE [Название]='Россия')),
('Новосибирск',(SELECT [ID страны] FROM [Страны] WHERE [Название]='Россия')),
('Краснодар',(SELECT [ID страны] FROM [Страны] WHERE [Название]='Россия')),
('Париж',(SELECT [ID страны] FROM [Страны] WHERE [Название]='Франция')),
('Лион',(SELECT [ID страны] FROM [Страны] WHERE [Название]='Франция')),
('Рим',(SELECT [ID страны] FROM [Страны] WHERE [Название]='Италия')),
('Астана',(SELECT [ID страны] FROM [Страны] WHERE [Название]='Казахстан')),
('Осло',(SELECT [ID страны] FROM [Страны] WHERE [Название]='Норвегия')),
('Стамбул',(SELECT [ID страны] FROM [Страны] WHERE [Название]='Турция')),
('Рига',(SELECT [ID страны] FROM [Страны] WHERE [Название]='Латвия')),
('Прага',(SELECT [ID страны] FROM [Страны] WHERE [Название]='Чехия')),
('Берлин',(SELECT [ID страны] FROM [Страны] WHERE [Название]='Германия')),
('Цюрих',(SELECT [ID страны] FROM [Страны] WHERE [Название]='Швейцария'));


INSERT INTO [Аэропорты] ([Код аэропорта], [Название аэропорта], [Город ID]) VALUES 
('SVO','Шереметьево', (SELECT [ID города] FROM [Города] WHERE [Название города]='Москва')),
('UFA','Уфа', (SELECT [ID города] FROM [Города] WHERE [Название города]='Уфа')),
('OVB','Толмачево', (SELECT [ID города] FROM [Города] WHERE [Название города]='Новосибирск')),
('KRR','Пашковский', (SELECT [ID города] FROM [Города] WHERE [Название города]='Краснодар')),
('CDG','Шарль-де-Голль', (SELECT [ID города] FROM [Города] WHERE [Название города]='Париж')),
('LYS','Лион-Сент-Экзюпери', (SELECT [ID города] FROM [Города] WHERE [Название города]='Лион')),
('FCO','Фьюмичино', (SELECT [ID города] FROM [Города] WHERE [Название города]='Рим')),
('TSE','Нурсултан Назарбаев', (SELECT [ID города] FROM [Города] WHERE [Название города]='Астана')),
('OSL','Гардермуэн', (SELECT [ID города] FROM [Города] WHERE [Название города]='Осло')),
('IST','Стамбул', (SELECT [ID города] FROM [Города] WHERE [Название города]='Стамбул')),
('RIX','Рига', (SELECT [ID города] FROM [Города] WHERE [Название города]='Рига')),
('PRG','Прага', (SELECT [ID города] FROM [Города] WHERE [Название города]='Прага')),
('SXF','Берлин-Шенефельд', (SELECT [ID города] FROM [Города] WHERE [Название города]='Берлин')),
('ZRH','Цюрих', (SELECT [ID города] FROM [Города] WHERE [Название города]='Цюрих')),
('VKO','Внуково', (SELECT [ID города] FROM [Города] WHERE [Название города]='Москва'));


INSERT INTO [Терминалы] ([ID аэропорта], [Название терминала]) VALUES 
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='SVO'), 'A'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='SVO'), 'B'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='SVO'), 'D'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='SVO'), 'E'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='SVO'), 'F'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='UFA'), '1'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='UFA'), '2'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='VKO'), 'A'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='VKO'), 'B'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='OVB'), 'A'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='OVB'), 'B'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='KRR'), '1'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='KRR'), '2'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='CDG'), '2A'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='LYS'), '1'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='FCO'), '3'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='TSE'), 'Т1'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='OSL'), '1'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='IST'), '2'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='RIX'), '1'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='PRG'), '1'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='SXF'), 'A'),
((SELECT [ID аэропорта] FROM [Аэропорты] WHERE [Код аэропорта]='ZRH'), 'A');

USE [Airport]
GO


INSERT INTO [Типы маршрутов] ([ID типа],[Название типа]) VALUES 
(1, 'Внутренний'),
(2, 'Международный')

INSERT INTO [Маршрут] ([Расстояние, км],  [ID типа], [Пункт вылета (код терминала)], [Пункт назначения (код терминала)]) VALUES 
(1164.0, 1, (SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='F'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Шереметьево'
							) 
	),
	(SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='1'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Уфа'
							) 
	)
),
(1164.0, 1, (SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='1'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Уфа'
							) 
	),
	(SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='F'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Шереметьево'
							) 
	)
),
(2487.0, 2, (SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='A'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Шереметьево'
							) 
	),
	(SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='2A'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Шарль-де-Голль'
							) 
	)
),
(2487.0, 2, (SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='2A'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Шарль-де-Голль'
							) 
	),
	(SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='A'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Шереметьево'
							) 
	)
),
(1756.0, 2, (SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='A'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Шереметьево'
							) 
	),
	(SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='2'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Стамбул'
							) 
	)
),
(1756.0, 2, (SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='2'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Стамбул'
							) 
	),
	(SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='A'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Шереметьево'
							) 
	)
),
(1714.0, 1, (SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='1'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Уфа'
							) 
	),
	(SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='A'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Толмачево'
							) 
	)
),
(1714.0, 1, (SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='A'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Толмачево'
							) 
	),
	(SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='1'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Уфа'
							) 
	)
),
(842.0, 2, (SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='B'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Внуково'
							) 
	),
	(SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='1'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Рига'
							) 
	)
),
(842.0, 2, (SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='1'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Рига'
							) 
	),
	(SELECT [ID терминала] 
	FROM [Терминалы] 
	WHERE [Название терминала]='B'	
	AND [ID аэропорта]= (SELECT [ID аэропорта]
							FROM [Аэропорты]
							WHERE [Название аэропорта]='Внуково'
							) 
	)
)
